apache/nuttx/configs/sam3u-ek/src/sam_lcd.c
#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/lcd/lcd.h>
#include <nuttx/video/rgbcolors.h>

#include <arch/irq.h>

#include "up_arch.h"
#include "sam_gpio.h"
#include "chip/sam_pmc.h"
#include "chip/sam_smc.h"
#include "sam3u-ek.h"

/**************************************************************************************
 * Pre-processor Definitions
 **************************************************************************************/

/* Configuration **********************************************************************/

/* Define the following to enable register-level debug output */

#undef CONFIG_LCD_REGDEBUG

/* Verbose debug must also be enabled */

#ifndef CONFIG_DEBUG
#  undef CONFIG_DEBUG_VERBOSE
#  undef CONFIG_DEBUG_LED
#endif

#ifndef CONFIG_DEBUG_VERBOSE
#  undef CONFIG_LCD_REGDEBUG
#endif

/* CONFIG_LCD_MAXCONTRAST -- must be defined and less than 32 */

#if !defined(CONFIG_LCD_MAXCONTRAST) || CONFIG_LCD_MAXCONTRAST < 1 || CONFIG_LCD_MAXCONTRAST > 31
#  error "CONFIG_LCD_MAXCONTRAST must be defined in the range 1 to 31"
#endif

/* Debug ******************************************************************************/

#ifdef CONFIG_LCD_REGDEBUG
#  define regdbg(format, ...)  vdbg(format, ##__VA_ARGS__)
#else
#  define regdbg(x...)
#endif

#ifdef CONFIG_DEBUG_LCD
#  define lcddbg(format, ...)  dbg(format, ##__VA_ARGS__)
#  define lcdvdbg(format, ...) vdbg(format, ##__VA_ARGS__)
#else
#  define lcddbg(x...)
#  define lcdvdbg(x...)
#endif

/* Graphics Capbilities ***************************************************************/

/* LCD resolution: 320 (columns) by 240 (rows).  The physical dimensions of the device
 * are really 240 (columns) by 320 (rows), but unless CONFIG_LCD_PORTRAIT is defined,
 * we swap rows and columns in setcursor to make things behave nicer (there IS a
 * performance hit for this swap!).
 */

#ifdef CONFIG_LCD_PORTRAIT
#  define SAM3UEK_XRES         240
#  define SAM3UEK_YRES         320
#else
#  define SAM3UEK_XRES         320
#  define SAM3UEK_YRES         240
#endif

/* Color depth and format. BPP=16 R=6, G=6, B=5: RRRR RBBB BBBG GGGG */

#define SAM3UEK_BPP          16
#define SAM3UEK_RGBFMT       FB_FMT_RGB16_565

/* HX834x Definitions  ****************************************************************/

/* HX834x register select */

#define HX843X_LCD_RS        (1 << 1)

/* HX8347 ID code */

#define HX8347_CHIPID        0x47

/* HX8347 LCD Registers */

#define HX8347_R00H          0x00
#define HX8347_R01H          0x01
#define HX8347_R02H          0x02
#define HX8347_R03H          0x03
#define HX8347_R04H          0x04
#define HX8347_R05H          0x05
#define HX8347_R06H          0x06
#define HX8347_R07H          0x07
#define HX8347_R08H          0x08
#define HX8347_R09H          0x09
#define HX8347_R0AH          0x0a
#define HX8347_R0CH          0x0c
#define HX8347_R0DH          0x0d
#define HX8347_R0EH          0x0e
#define HX8347_R0FH          0x0f
#define HX8347_R10H          0x10
#define HX8347_R11H          0x11
#define HX8347_R12H          0x12
#define HX8347_R13H          0x13
#define HX8347_R14H          0x14
#define HX8347_R15H          0x15
#define HX8347_R16H          0x16
#define HX8347_R18H          0x18
#define HX8347_R19H          0x19
#define HX8347_R1AH          0x1a
#define HX8347_R1BH          0x1b
#define HX8347_R1CH          0x1c
#define HX8347_R1DH          0x1d
#define HX8347_R1EH          0x1e
#define HX8347_R1FH          0x1f
#define HX8347_R20H          0x20
#define HX8347_R21H          0x21
#define HX8347_R22H          0x22
#define HX8347_R23H          0x23
#define HX8347_R24H          0x24
#define HX8347_R25H          0x25
#define HX8347_R26H          0x26
#define HX8347_R27H          0x27
#define HX8347_R28H          0x28
#define HX8347_R29H          0x29
#define HX8347_R2AH          0x2a
#define HX8347_R2BH          0x2b
#define HX8347_R2CH          0x2c
#define HX8347_R2DH          0x2d
#define HX8347_R35H          0x35
#define HX8347_R36H          0x36
#define HX8347_R37H          0x37
#define HX8347_R38H          0x38
#define HX8347_R39H          0x39
#define HX8347_R3AH          0x3a
#define HX8347_R3BH          0x3b
#define HX8347_R3CH          0x3c
#define HX8347_R3DH          0x3d
#define HX8347_R3EH          0x3e
#define HX8347_R40H          0x40
#define HX8347_R41H          0x41
#define HX8347_R42H          0x42
#define HX8347_R43H          0x43
#define HX8347_R44H          0x44
#define HX8347_R45H          0x45
#define HX8347_R46H          0x46
#define HX8347_R47H          0x47
#define HX8347_R48H          0x48
#define HX8347_R49H          0x49
#define HX8347_R4AH          0x4a
#define HX8347_R4BH          0x4b
#define HX8347_R4CH          0x4c
#define HX8347_R4DH          0x4d
#define HX8347_R4EH          0x4e
#define HX8347_R4FH          0x4f
#define HX8347_R50H          0x50
#define HX8347_R51H          0x51
#define HX8347_R64H          0x64
#define HX8347_R65H          0x65
#define HX8347_R66H          0x66
#define HX8347_R67H          0x67
#define HX8347_R70H          0x70
#define HX8347_R72H          0x72
#define HX8347_R90H          0x90
#define HX8347_R91H          0x91
#define HX8347_R93H          0x93
#define HX8347_R94H          0x94
#define HX8347_R95H          0x95

/**************************************************************************************
 * Private Type Definition
 **************************************************************************************/

/* This structure describes the state of this driver */

struct sam_dev_s
{
  /* Publically visible device structure */

  struct lcd_dev_s dev;

  /* Private device state */

  uint8_t power;    /* The current power setting */
};

/**************************************************************************************
 * Private Function Protototypes
 **************************************************************************************/

/* Low-level HX834x Register access */

static void sam_putreg(uint16_t reg,  uint16_t data);
#ifdef CONFIG_DEBUG_LCD
static uint16_t sam_getreg(uint16_t reg);
#endif

/* Misc. LCD Helper Functions */

