apache/nuttx/configs/sam3u-ek/src/sam_lcd.c
static void sam_setcursor(fb_coord_t row, fb_coord_t col);
static inline void sam_wrsetup(void);
static inline void sam_wrram(uint16_t color);
static inline uint16_t sam_rdram(void);
static void sam_lcdon(void);
static void sam_lcdoff(void);

#if 0 /* CONFIG_DEBUG_LCD */
static void sam_dumpreg(uint8_t startreg, uint8_t endreg);
#endif

/* LCD Data Transfer Methods */

static int sam_putrun(fb_coord_t row, fb_coord_t col, FAR const uint8_t *buffer,
             size_t npixels);
static int sam_getrun(fb_coord_t row, fb_coord_t col, FAR uint8_t *buffer,
             size_t npixels);

/* LCD Configuration */

static int sam_getvideoinfo(FAR struct lcd_dev_s *dev,
             FAR struct fb_videoinfo_s *vinfo);
static int sam_getplaneinfo(FAR struct lcd_dev_s *dev, unsigned int planeno,
             FAR struct lcd_planeinfo_s *pinfo);

/* LCD RGB Mapping */

#ifdef CONFIG_FB_CMAP
#  error "RGB color mapping not supported by this driver"
#endif

/* Cursor Controls */

#ifdef CONFIG_FB_HWCURSOR
#  error "Cursor control not supported by this driver"
#endif

/* LCD Specific Controls */

static int sam_getpower(struct lcd_dev_s *dev);
static int sam_setpower(struct lcd_dev_s *dev, int power);
static int sam_getcontrast(struct lcd_dev_s *dev);
static int sam_setcontrast(struct lcd_dev_s *dev, unsigned int contrast);

/**************************************************************************************
 * Private Data
 **************************************************************************************/

/* This is working memory allocated by the LCD driver for each LCD device
 * and for each color plane.  This memory will hold one raster line of data.
 * The size of the allocated run buffer must therefor be at least
 * (bpp * xres / 8).  Actual alignment of the buffer must conform to the
 * bitwidth of the underlying pixel type.
 *
 * If there are multiple planes, they may share the same working buffer
 * because different planes will not be operate on concurrently.  However,
 * if there are multiple LCD devices, they must each have unique run buffers.
 */

static uint16_t g_runbuffer[SAM3UEK_XRES];

/* This structure describes the overall LCD video controller */

static const struct fb_videoinfo_s g_videoinfo =
{
  .fmt     = SAM3UEK_RGBFMT,      /* Color format: RGB16-565: RRRR RGGG GGGB BBBB */
  .xres    = SAM3UEK_XRES,        /* Horizontal resolution in pixel columns */
  .yres    = SAM3UEK_YRES,        /* Vertical resolution in pixel rows */
  .nplanes = 1,                   /* Number of color planes supported */
};

/* This is the standard, NuttX Plane information object */

static const struct lcd_planeinfo_s g_planeinfo =
{
  .putrun = sam_putrun,            /* Put a run into LCD memory */
  .getrun = sam_getrun,            /* Get a run from LCD memory */
  .buffer = (uint8_t*)g_runbuffer, /* Run scratch buffer */
  .bpp    = SAM3UEK_BPP,           /* Bits-per-pixel */
};

/* This is the standard, NuttX LCD driver object */

static struct sam_dev_s g_lcddev_s =
{
  .dev =
  {
    /* LCD Configuration */

    .getvideoinfo = sam_getvideoinfo,
    .getplaneinfo = sam_getplaneinfo,

    /* LCD RGB Mapping -- Not supported */
    /* Cursor Controls -- Not supported */

    /* LCD Specific Controls */

    .getpower     = sam_getpower,
    .setpower     = sam_setpower,
    .getcontrast  = sam_getcontrast,
    .setcontrast  = sam_setcontrast,
  },
};

/**************************************************************************************
 * Private Functions
 **************************************************************************************/

/**************************************************************************************
 * Name:  sam_putreg
 *
 * Description:
 *   Write to a HX834x register
 *
 **************************************************************************************/

static void sam_putreg(uint16_t reg,  uint16_t data)
{
  regdbg("base: %08x RS: %04x data: %04x\n", LCD_BASE, LCD_BASE + HX843X_LCD_RS, data);
  putreg16(reg, LCD_BASE);
  putreg16(data, LCD_BASE + HX843X_LCD_RS);
}

/**************************************************************************************
 * Name:  sam_getreg
 *
 * Description:
 *   Read from a HX834x register
 *
 **************************************************************************************/

#ifdef CONFIG_DEBUG_LCD
static uint16_t sam_getreg(uint16_t reg)
{
  uint16_t data;
  putreg16(reg, LCD_BASE);
  data = getreg16(LCD_BASE + HX843X_LCD_RS);
  regdbg("base: %08x RS: %04x data: %04x\n", LCD_BASE, LCD_BASE + HX843X_LCD_RS, data);
  return data;
}
#endif

/**************************************************************************************
 * Name:  sam_setcursor
 *
 * Description:
 *   Set the LCD cursor position.
 *
 **************************************************************************************/

static void sam_setcursor(fb_coord_t row, fb_coord_t col)
{
  uint8_t  x1;
  uint8_t  x2;
  uint8_t  y1;
  uint8_t  y2;

  /* Get the upper and lower x and y positions */

  x1  = (uint8_t)col;
  x2  = (uint8_t)((uint16_t)col >> 8);

  y1  = (uint8_t)row;
  y2  = (uint8_t)((uint16_t)row >> 8);

  /* Then set the cursor position */

  sam_putreg(HX8347_R02H, x2);        /* column high */
  sam_putreg(HX8347_R03H, x1);        /* column low */
  sam_putreg(HX8347_R06H, y2);        /* row high */
  sam_putreg(HX8347_R07H, y1);        /* row low */
}

/**************************************************************************************
 * Name:  sam_wrsetup
 *
 * Description:
 *   Set up for a GRAM write operation.
 *
 **************************************************************************************/

static inline void sam_wrsetup(void)
{
  putreg16(HX8347_R22H, LCD_BASE);
}

/**************************************************************************************
 * Name: sam_wrram
 *
 * Description:
 *   Write to the 16-bit GRAM register
 *
 **************************************************************************************/

static inline void sam_wrram(uint16_t color)
{
  putreg16(color, LCD_BASE + HX843X_LCD_RS);
}

/**************************************************************************************
 * Name: sam_rdram
 *
 * Description:
 *   Read from the 16-bit GRAM register
 *
 **************************************************************************************/

static inline uint16_t sam_rdram(void)
{
  return getreg16(LCD_BASE + HX843X_LCD_RS);
}

/**************************************************************************************
 * Name:  sam_lcdon
 *
 * Description:
 *   Turn the LCD on
 *
 **************************************************************************************/

static void sam_lcdon(void)
{
  /* Display ON Setting */

  lcdvdbg("ON\n");
  sam_putreg(HX8347_R90H, 0x7f);      /* SAP=0111 1111 */
  sam_putreg(HX8347_R26H, 0x04);      /* GON=0 DTE=0 D=01 */
  up_mdelay(100);
  sam_putreg(HX8347_R26H, 0x24);      /* GON=1 DTE=0 D=01 */
  sam_putreg(HX8347_R26H, 0x2c);      /* GON=1 DTE=0 D=11 */
  up_mdelay(100);
  sam_putreg(HX8347_R26H, 0x3c);      /* GON=1 DTE=1 D=11 */
}

/**************************************************************************************
 * Name:  sam_lcdoff
 *
 * Description:
 *   Turn the LCD off
 *
 **************************************************************************************/

static void sam_lcdoff(void)
{
  lcdvdbg("OFF\n");
  sam_putreg(HX8347_R90H, 0x00);      /* SAP=0000 0000 */
  sam_putreg(HX8347_R26H, 0x00);      /* GON=0 DTE=0 D=00 */
}

/**************************************************************************************
 * Name:  sam_dumpreg
 *
 * Description:
 *   Dump a range of LCD registers.
 *
 **************************************************************************************/

#if 0 /* CONFIG_DEBUG_LCD */
static void sam_dumpreg(uint8_t startreg, uint8_t endreg)
{
  uint16_t value;
  uint8_t  addr;

  for (addr = startreg; addr <= endreg; addr++)
    {
      value = sam_getreg(addr);
      lcddbg(" %02x: %04x\n", addr, value);
    }
}
#endif

/**************************************************************************************
 * Name:  sam_putrun
 *
 * Description:
 *   This method can be used to write a partial raster line to the LCD:
 *
 *   row     - Starting row to write to (range: 0 <= row < yres)
 *   col     - Starting column to write to (range: 0 <= col <= xres-npixels)
 *   buffer  - The buffer containing the run to be written to the LCD
 *   npixels - The number of pixels to write to the LCD
 *             (range: 0 < npixels <= xres-col)
 *
 **************************************************************************************/

static int sam_putrun(fb_coord_t row, fb_coord_t col, FAR const uint8_t *buffer,
                      size_t npixels)
{
  uint16_t *run = (uint16_t*)buffer;
  unsigned int i;

  /* Buffer must be provided and aligned to a 16-bit address boundary */

  lcdvdbg("row: %d col: %d npixels: %d\n", row, col, npixels);
  DEBUGASSERT(buffer && ((uintptr_t)buffer & 1) == 0);

#ifdef CONFIG_LCD_PORTRAIT
  /* Set up to write the run. */

  sam_setcursor(row, col);
  sam_wrsetup();

  /* Write the run to GRAM. */

